documents/book/99-appendix.org
#+title:        Appendix: The Annotated Emacs Writing Studio Configuration
#+property:     header-args:elisp :tangle ../../init.el :results none :eval no
#+bibliography: ../emacs-writing-studio.bib
#+startup:      content

This appendix presents and explains the {{{ews}}} (EWS) configuration. The configuration is annotated to explain the logic of the code and provides some options for enhancements or additional functionality. This configuration follows the following principles:

- Leverage functionality of the latest version of GNU Emacs
- Minimalist configuration
- Use standard keyboard shortcuts
- Centred around Org mode
- No configuration for writing code

This configuration is a starting point for your Emacs journey. Feel free to modify any part of the EWS initialisation file and study its effects. You can find the latest version of this configuration on GitHub:

#+begin_example
github.com/pprevos/emacs-writing-studio
#+end_example

This repository is not actively maintained. For beginning Emacs users, the configuration acts as a starting point to develop a configuration. More advanced users can copy ideas. The code will only be updated when there are bugs due to future changes in packages or Emacs itself.
  
#+begin_src elisp :exports none
  ;;; init.el --- Emacs Writing Studio init -*- lexical-binding: t; -*-

  ;; Copyright (C) 2024 Peter Prevos

  ;; Author: Peter Prevos <peter@prevos.net>
  ;; Maintainer: Peter Prevos <peter@prevos.net>
  ;; URL: https://github.com/pprevos/emacs-writing-studio/
  ;;
  ;; This file is NOT part of GNU Emacs.
  ;;
  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  ;; GNU General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program. If not, see <https://www.gnu.org/licenses/>.
  ;;
  ;;; Commentary:
  ;;
  ;; Emacs Writing Studio init file
  ;; https://lucidmanager.org/tags/emacs
  ;;
  ;; This init file is tangled from the Org mode source:
  ;; documents/ews-book/99-appendix.org
  ;;
  ;;; Code:
#+end_src

* Using EWS
The first part of the configuration sets the basic principles of the EWS configuration, such as package management, the user interface look and feel, the minibuffer completion system and basic settings to enable writing for humans.

** Basic configuration
The first part of the configuration checks if the latest version of Emacs is running. EWS leverages some of the newest functionality, so you must install this version. Note that the expression or higher ~(< emacs-major-version 29)~ is in Polish notation. In Lisp, the operator is placed before the operands, unlike the more common infix notation, which places the operator between the operands, e.g. ~emacs-major-version < 29~. 

#+begin_src elisp :exports none
  ;; Emacs 29 avaibale?
#+end_src
#+begin_src elisp
  (when (< emacs-major-version 29)
    (error "Emacs Writing Studio requires Emacs version 29 or later"))
#+end_src

Any changes made by the Emacs customisation system in EWS are stored in =custom.el= instead of directly to the init file. This approach prevents the customisation system from modifying the initialisation file. The =custom.el= file is loaded when found. If variables are set in both the custom and the init files, the =init.el= file takes preference.

#+begin_src elisp :exports none
  ;; Custom settings in a separate file and load the custom settings
#+end_src  
#+begin_src elisp
  (setq-default custom-file (expand-file-name "custom.el" user-emacs-directory))

  (load custom-file :no-error-if-file-is-missing)
#+end_src

Keyboard shortcuts defined in EWS all use the =C-c w= prefix. Access the ~customise-variable~ function with the =C-c w v= shortcut.

#+begin_src elisp
  (keymap-global-set "C-c w v" 'customize-variable)
#+end_src

** Emacs packages
Emacs users have developed and shared thousands of packages with the rest of the community. These packages are written in Emacs Lisp and extend its capabilities. This part of the configuration sets the essential elements to load and install packages from the MELPA archive (=melpa.org=).

#+begin_src elisp :exports none
  ;; Set package archives
#+end_src
#+begin_src elisp
  (use-package package
    :config
    (add-to-list 'package-archives
                 '("melpa" . "https://melpa.org/packages/"))
    (package-initialize))
#+end_src

This configuration implements John Wiegley's Use-Package. This package simplifies installing and configuring packages with a standardised and easy-to-read method. Software developers call such a tool 'syntactic sugar', which is syntax designed to make code easier to read or write, making the language "sweeter" for humans [cite:@landin_1964].

The Use-Package system consists of a set of statements between parenthesis, which is a macro. In its simplest form, it is something like ~(use-package <package-name>)~. The code can also contain one or more sections to set various options. The =:custom= section below sets three variables. These variables enact three protocols. Any missing package is automatically installed from its online source, and the source code is compiled to speed up Emacs. Thirdly, compilation warnings are kept to a minimum so as not to scare beginning users with log files.

#+begin_src elisp :exports none
  ;; Package Management
#+end_src
#+begin_src elisp
  (use-package use-package
    :custom
    (use-package-always-ensure t)
    (package-native-compile t)
    (warning-minimum-level :emergency))
#+end_src

To read the finer details of the Use-Package macro, read the manual with =C-h R use-package=.

** Emacs Writing Studio functionality
EWS also provides a range of bespoke convenience functions for various aspects of the writing process. Ensure you download this file from the EWS repository.

#+begin_src elisp :exports none
  ;; Load EWS functions
#+end_src
#+begin_src elisp
  (load-file (concat (file-name-as-directory user-emacs-directory) "ews.el"))
#+end_src

The ~ews-missing-executables~ function checks if external software is available on your system. Emacs writes a message in the minibuffer if any of the recommended tools are missing. You can jump to the Messages buffer with =C-h e= to review the output. Emacs will function normally when this software is unavailable, but some features might not work.

The input for this function is a list, a series of strings between parenthesis that starts with a tick symbol: ~'("this" "is" "a" "list")~ The tick prevents Emacs from confusing the list of data with a function. In this function, some lists also contains other lists.

This function checks whether all these packages are available on your system. For software in a nested list, such as =("convert" "gm")=, only one of them has to be available, as these programs are alternatives for the same functionality.

#+begin_src elisp :exports none
  ;; Check for missing external software
  ;;
  ;; - soffice (LibreOffice): View and create office documents
  ;; - zip: Unpack ePub documents
  ;; - pdftotext (poppler-utils): Convert PDF to text
  ;; - ddjvu (DjVuLibre): View DjVu files
  ;; - curl: Reading RSS feeds
  ;; - convert (ImageMagick) or gm (GraphicsMagick): Convert image files  ;; - latex (TexLive, MacTex or MikTeX): Preview LaTex and export Org to PDF
  ;; - hunspell: Spellcheck. Also requires a hunspell dictionary
  ;; - grep: Search inside files
  ;; - gs (GhostScript) or mutool (MuPDF): View PDF files
  ;; - mpg321, ogg123 (vorbis-tools), mplayer, mpv, vlc: Media players
  ;; - git: Version control
#+end_src
#+begin_src elisp
  (ews-missing-executables
   '("soffice"
     "zip"
     "pdftotext"
     "ddjvu"
     "curl"
     ("convert" "gm")
     "latex"
     "hunspell"
     "grep"
     ("gs" "mutool")
     ("mpg321" "ogg123" "mplayer" "mpv" "vlc")
     "git"))
#+end_src

