documents/book/99-appendix.org
** Look and feel
EWS espouses a minimalist aesthetic to provide a distraction-free environment. The first three lines of code disable the toolbar, the menu bar, and the scroll bar. The menu bar can be useful for beginners, and you can still access it with the =F10= key. If you like to keep the tool, menu, and/or scroll bars, then either remove the relevant lines, change the =-1= to a =1=, or add two semicolons at the start of the relevant lines to convert them to comments.

#+begin_src elisp :exports none
  ;;; LOOK AND FEEL
#+end_src
#+begin_src elisp
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src

Vanilla Emacs has the slightly paternalistic habit of requiring a single =y= or =n= answer, while on some occasions, it requires you to type =yes= or =no=, due to the perceived higher risk of typing the wrong answer. The ~setq~ function sets the ~use-short-answers~ variable to =t=. If you want to retain this behaviour, change the =t= to =nil=.

In Emacs Lisp, =t= means TRUE and =nil= is equivalent to FALSE. Emacs documentation often mentions setting a value to "non-nil", which is a double negative to suggest setting the variable to true.

#+begin_src elisp :exports none
  ;; Short answers only please
#+end_src
#+begin_src elisp
  (setq-default use-short-answers t)
#+end_src

The next two sections of code further improve the Emacs interface with two packages by Emacs guru Protesilaos Stavrou.

The spacious padding package creates space around windows, preventing crammed text on your screen. The =:init= section contains code Emacs evaluates when loading the package. In this case, it enables the Spacious Padding mode. The =:custom= section also sets the line spacing to a more generous value. You can read the manual for this mode with =C-h R spacious=.

This configuration also modifies the ~line-spacing~ variable to create some space between logical lines. This variable is not part of the Spacious Padding package.

#+begin_src elisp :exports none
  ;; Spacious padding
#+end_src
#+begin_src elisp
  (use-package spacious-padding
    :custom
    (line-spacing 3)
    :init
    (spacious-padding-mode 1))
#+end_src

The next package sets the Emacs theme. A theme is a set of configurations for fonts and colours. Themes are available in two types: light or dark background.

The Modus themes package is highly configurable. This Use-Package declaration contains a three sections. The =:custom= section customises variables used in the package. In this case, we instruct the package to use italic and bold fonts for emphasis and allow for fonts with fixed and variable pitch. The code also slightly increases the size of headings. You can toggle between a dark and a light version of this theme, and the last variable defines which to toggle between. EWS uses the tinted version of the themes, which you can modify.

The =:custom= section of the macro sets some variables to define fonts. This section also defines which themes are toggled when switching between light and dark themes with =C-c w t t=. The default is the tinted versions. If you want your configuration to default to the high-contrast versions or one of the two colour blindness-safe versions, customise the ~modus-themes-to-toggle~ variable. To see the possible options for the Modus themes, use the help file: =C-h v modus-themes-collection=.

The following section binds some keys to commands to toggle between dark and light or select any available modus themes. All EWS custom keybindings start with =C-c w= as the prefix key and =C-c w t= as the prefix key for the theme-related functions. You can obviously change these to suit your preferences. Read the Modus Themes package manual for details with =C-h R modus=.

The ~consult-theme~ command invoke the consult package to help you select between installed themes.

As a bonus, this code also installs Port's Ef-Themes package, which is a wonderful collection of light and dark themes.

To set a default theme, run the ~customize-themes~ command and select your preferred version. Click the button to store your chosen default in the =custom.el= file

#+begin_src elisp :exports none
  ;; Modus and EF Themes
#+end_src
#+begin_src elisp
  (use-package modus-themes
    :custom
    (modus-themes-italic-constructs t)
    (modus-themes-bold-constructs t)
    (modus-themes-mixed-fonts t)
    (modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi-tinted))
    :bind
    (("C-c w t t" . modus-themes-toggle)
     ("C-c w t m" . modus-themes-select)
     ("C-c w t s" . consult-theme)))

  (use-package ef-themes)
#+end_src

The next section hooks the Variable Pitch mode to any Org buffer. This means that written prose is displayed in variable pitch, while metadata, code and other items are in fixed pitch. A hook is a construction in Emacs that associates modes with each other. In this case, variable pitch text is enabled for all text mode buffers.

#+begin_src elisp :exports none
  ;; Mixed-pich mode
#+end_src
#+begin_src elisp
  (use-package mixed-pitch
    :hook
    (org-mode . mixed-pitch-mode))
#+end_src

This last code snippet in the look-and-feel section changes how Emacs automatically split windows to favour vertical splits over horizontal ones to improve readability. This section also installs the Balanced Windows package, which manages window sizes automatically. For example, when you have three open windows and you close one, the remaining windows each get half the screen.

#+begin_src elisp :exports none
  ;; Window management
  ;; Split windows sensibly
#+end_src
#+begin_src elisp
  (setq split-width-threshold 120
        split-height-threshold nil)
#+end_src
#+begin_src elisp  :exports none
  ;; Keep window sizes balanced
#+end_src
#+begin_src elisp
  (use-package balanced-windows
    :config
    (balanced-windows-mode))
#+end_src

** Minibuffer completion
EWS uses the Vertico-Orderless-Marginalia stack of minibuffer completion packages in their standard configuration. Chapter [[#chap-ews]] explains how to use minibuffer completion.

#+begin_src elisp :exports none
  ;; MINIBUFFER COMPLETION

  ;; Enable vertico
#+end_src
#+begin_src elisp
  (use-package vertico
    :init
    (vertico-mode)
    :custom
    (vertico-sort-function 'vertico-sort-history-alpha))
#+end_src
#+begin_src elisp :exports none
  ;; Persist history over Emacs restarts.
#+end_src
#+begin_src elisp
  (use-package savehist
    :init
    (savehist-mode))
#+end_src
#+begin_src elisp :exports none
  ;; Search for partial matches in any order
#+end_src
#+begin_src elisp
  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides
     '((file (styles partial-completion)))))
#+end_src
#+begin_src elisp :exports none
  ;; Enable richer annotations using the Marginalia package
#+end_src
#+begin_src elisp
  (use-package marginalia
    :init
    (marginalia-mode))
#+end_src

** Keyboard shortcuts menu
The Which-Key package improves the discoverability of keyboard shortcuts with a popup in the minibuffer.

Due to the naming conventions in Emacs, most functions start with the package name, so some can be long. The problem is that the most interesting part of a function name is at the end of the string, so we don't want that to be hidden. This configuration widens the columns a bit to prevent truncated function names. This configuration also instructs Which-Key to order the list by function name rather than by key. 

#+begin_src elisp :exports none
  ;; Improve keyboard shortcut discoverability
#+end_src
#+begin_src elisp
  (use-package which-key
    :config
    (which-key-mode)
    :custom
    (which-key-max-description-length 40)
    (which-key-lighter nil)
    (which-key-sort-order 'which-key-description-order))
#+end_src

** Improved help functionality
Emacs is advertised as a "self-documenting text editor". While this is not entirely correct (if only computer code could document itself), every aspect of Emacs is documented within the source code.

Emacs has two levels of help. Firstly, there are the manuals for Emacs itself and some of the packages. Also each individual command and function contains documentation. The Helpful package by Wilfred Hughes adds contextual information to the built-in Emacs help. For example, when asking for documentation about a variable, the help file links to its customisation screen or the source code.

#+begin_src elisp :exports none
  ;; Improved help buffers
#+end_src
#+begin_src elisp
  (use-package helpful
    :bind
    (("C-h f" . helpful-function)
     ("C-h x" . helpful-command)
     ("C-h k" . helpful-key)
     ("C-h v" . helpful-variable)))
#+end_src

** Configure text modes
Emacs is principally designed for developing computer code, so it needs some modifications to enable writing text for humans. The config first ensures that Emacs does not try to install Text-Mode as a package, because it is buult-in.

Secondly, we hook Visual Line Mode to Text Mode. Visual Line mode wraps long lines to the nearest word to fit in the current window, as is common in word processing software.

By default, Emacs does not replace text when you select a section and start typing, which is unusual behaviour when writing prose. The =:init= section enables a more common default so that selected text is deleted when typed over. The =:custom= section enables the page-up and page-down keys to scroll to the top or bottom of a buffer. This section also redefines the way Emacs defines a sentence (refer to section [[#sec-count]]). The last variable saves any existing clipboard text into the kill ring for better operability between the operating system's clipboard and Emacs's kill ring.

#+begin_src elisp :exports none
  ;;; Text mode settings
#+end_src
#+begin_src elisp
  (use-package text-mode
    :ensure
    nil
    :hook
    (text-mode . visual-line-mode)
    :init
    (delete-selection-mode t)
    :custom
    (sentence-end-double-space nil)
    (scroll-error-top-bottom t)
    (save-interprogram-paste-before-kill t))
#+end_src

** Spellchecking
Writing without automated spell-checking would be quite annoying, even for the most experienced authors. The Flyspell package interfaces with the Hunspell software and the relevant dictionary to check spelling on the fly.

You must change the standard dictionary to your local variety with the ~ews-hunspell-dictionaries~  variable. EWS uses this particular variable because the dictionaries are set in two places to enable multilingual spelling. You can set multiple dictionaries for the same buffer. In my configuration I use ="en_AU,nl_NL"= so I can write in either the Australian variant of English of Dutch without having to change dictionaries. Section [[#sec-spelling]] explains how to use this package.

#+begin_src elisp :exports none
  ;; Check spelling with flyspell and hunspell
#+end_src
#+begin_src elisp
  (use-package flyspell
    :custom
    (ispell-program-name "hunspell")
    (ispell-dictionary ews-hunspell-dictionaries)
    (flyspell-mark-duplications-flag nil) ;; Writegood mode does this
    (org-fold-core-style 'overlays) ;; Fix Org mode bug
    :config
    (ispell-set-spellchecker-params)
    (ispell-hunspell-add-multi-dic ews-hunspell-dictionaries)
    :hook
    (text-mode . flyspell-mode)
    :bind
    (("C-c w s s" . ispell)
     ("C-;"       . flyspell-auto-correct-previous-word)))
#+end_src

