documents/book/99-appendix.org
** Denote
Denote is a flexible note-taking and file management package. Refer to [[#sec-denote]] or the extensive Denote manual with =C-h R denote=. At a minimum, you need to configure the ~denote-directory~ variable to indicate the location of your notes.

The EWS package includes a convenience function to improve how Denote displays links to attachments, linked to the ~denote-link-description-function~.

#+begin_src elisp :exports none
  ;; Denote
#+end_src
#+begin_src elisp
  (use-package denote
    :defer t
    :custom
    (denote-sort-keywords t)
    (denote-link-description-function #'ews-denote-link-description-title-case)
    :hook
    (dired-mode . denote-dired-mode)
    :custom-face
    (denote-faces-link ((t (:slant italic))))
    :init
    (require 'denote-org-extras)
    :bind
    (("C-c w d b" . denote-find-backlink)
     ("C-c w d d" . denote-date)
     ("C-c w d l" . denote-find-link)
     ("C-c w d h" . denote-org-extras-link-to-heading)
     ("C-c w d i" . denote-link-or-create)
     ("C-c w d k" . denote-rename-file-keywords)
     ("C-c w d n" . denote)
     ("C-c w d r" . denote-rename-file)
     ("C-c w d R" . denote-rename-file-using-front-matter)))
#+end_src

The Consult package provides some convenience functionality to make life easier.

The ~consult-org-heading~ command provides a table of contents of the Org mode file to quickly move around a large file. The ~consult-grep~ function lets you search through files in the current directory. The search functionality requires access to the Grep software. 

Consult has a lot more functionality that replaces some base Emacs commands with more convenient version. Most of these have not been enabled to ensure we stay as close as possible to vanilla Emacs. The Consult online documentation provides detailed descriptions of these enhanced commands.

#+begin_src elisp :exports none
  ;; Consult convenience functions
#+end_src
#+begin_src elisp
  (use-package consult
    :bind
    (("C-c w h" . consult-org-heading)
     ("C-c w g" . consult-grep)))
#+end_src

Consult Notes is a convenience package that builds on Consult. It provides access to Denote files and also lets you search through your notes.

#+begin_src elisp :exports none
  ;; Consult-Notes for easy access to notes
#+end_src
#+begin_src elisp
  (use-package consult-notes
    :bind
    (("C-c w d f" . consult-notes)
     ("C-c w d g" . consult-notes-search-in-all-notes))
    :init
    (consult-notes-denote-mode))
#+end_src

The Citar-Denote package lets you create a many-to-many relationship between your Denote notes and items in your bibliography (section [[#sec-citar-denote]]).

#+begin_src elisp :exports none
  ;; Citar-Denote to manage literature notes
#+end_src
#+begin_src elisp
  (use-package citar-denote
    :custom
    (citar-open-always-create-notes t)
    :init
    (citar-denote-mode)
    :bind
    (("C-c w b c" . citar-create-note)
     ("C-c w b n" . citar-denote-open-note)
     ("C-c w b x" . citar-denote-nocite)
     :map org-mode-map
     ("C-c w b k" . citar-denote-add-citekey)
     ("C-c w b K" . citar-denote-remove-citekey)
     ("C-c w b d" . citar-denote-dwim)
     ("C-c w b e" . citar-denote-open-reference-entry)))
#+end_src

The Denote-Explore package provides convenience functions to manage your collection of notes and attachments (section [[#sec-denote-explore]]).

#+begin_src elisp :exports none
  ;; Explore and manage your Denote collection
#+end_src
#+begin_src elisp
  (use-package denote-explore
    :bind
    (;; Statistics
     ("C-c w x c" . denote-explore-count-notes)
     ("C-c w x C" . denote-explore-count-keywords)
     ("C-c w x b" . denote-explore-barchart-keywords)
     ("C-c w x e" . denote-explore-barchart-filetypes)
     ;; Random walks
     ("C-c w x r" . denote-explore-random-note)
     ("C-c w x l" . denote-explore-random-link)
     ("C-c w x k" . denote-explore-random-keyword)
     ("C-c w x x" . denote-explore-random-regex)
     ;; Denote Janitor
     ("C-c w x d" . denote-explore-identify-duplicate-notes)
     ("C-c w x z" . denote-explore-zero-keywords)
     ("C-c w x s" . denote-explore-single-keywords)
     ("C-c w x o" . denote-explore-sort-keywords)
     ("C-c w x w" . denote-explore-rename-keyword)
     ;; Visualise denote
     ("C-c w x n" . denote-explore-network)
     ("C-c w x v" . denote-explore-network-regenerate)
     ("C-c w x D" . denote-explore-degree-barchart)))
#+end_src

* Production
** Managing the writing process
The EWS repository provides some Org-related convenience files for inserting notes, drawers, and counting words. At this stage, the screenshot command is experimental.

#+begin_src elisp :exports none
  ;; Set some Org mode shortcuts
#+end_src
#+begin_src elisp
  (use-package org
    :bind
    (:map org-mode-map
          ("C-c w n" . ews-org-insert-notes-drawer)
          ("C-c w p" . ews-org-insert-screenshot)
          ("C-c w c" . ews-org-count-words)))
#+end_src

The Olivetti package removes distractions from the screen and converts your Emacs session to an electronic typewriter. The ~ews-olivetti~ function stores the screen configuration before you activate the distraction-free writing mode. When you disable Olivetti mode with this function then the original configuration is restored.

#+begin_src elisp :exports none
  ;; Distraction-free writing
#+end_src
#+begin_src elisp
  (use-package olivetti
    :demand t
    :bind
    (("C-c w o" . ews-olivetti)))
#+end_src

Undo-Tree provides a graphical view of the various versions of the current buffer.

#+begin_src elisp :exports none
  ;; Undo Tree
#+end_src
#+begin_src elisp
  (use-package undo-tree
    :config
    (global-undo-tree-mode)
    :custom
    (undo-tree-auto-save-history nil)
    :bind
    (("C-c w u" . undo-tree-visualise)))
#+end_src

** Citations
This configuration sets the global bibliography equal to the ~ews-bibtex-files~ variable. To set this variable, configure the ~ews-bibtex-directory~ to register bibliography files and run the ~ews-bibtex-register~ function every time you add new bib-files.

#+begin_src elisp :exports none
  ;; Export citations with Org Mode
#+end_src
#+begin_src elisp
  (require 'oc-natbib)
  (require 'oc-csl)

  (setq org-cite-global-bibliography ews-bibtex-files
        org-cite-insert-processor 'citar
        org-cite-follow-processor 'citar
        org-cite-activate-processor 'citar)
#+end_src

** Quality assurance
Emacs can hook into the dictionary server at =dict.org= and the Powerthesaurus package integrates with =powerthesaurus.org=. Refer to section [[#sec-qa]] for details.

#+begin_src elisp :exports none
  ;; Lookup words in the online dictionary
#+end_src
#+begin_src elisp
  (use-package dictionary
    :custom
    (dictionary-server "dict.org")
    :bind
    (("C-c w s d" . dictionary-lookup-definition)))
#+end_src
#+begin_src elisp
  (use-package powerthesaurus
    :bind
    (("C-c w s p" . powerthesaurus-transient)))
#+end_src

The Writegood package helps to detect weasel words, passive writing, and repeated words. It also contains functions to estimate a text's complexity using the Flesch-Kincaid test.

#+begin_src elisp :exports none
  ;; Writegood-Mode for weasel words, passive writing and repeated word detection
#+end_src
#+begin_src elisp
  (use-package writegood-mode
    :bind
    (("C-c w s r" . writegood-reading-ease)
     ("C-c w s l" . writegood-grade-level))
    :hook
    (text-mode . writegood-mode))
#+end_src

The TitleCase package strives for the most accurate title-casing of sentences, lines, and regions of text in English prose. You can customise the ~titlecase-style~ variable 

The EWS convenience function can do this for all headings in an Org file to ensure consistency (section [[#sec-titlecase]]).

#+begin_src elisp :exports none
  ;; Titlecasing
#+end_src
#+begin_src elisp
  (use-package titlecase
    :bind
    (("C-c w s t" . titlecase-dwim)
     ("C-c w s c" . ews-org-headings-titlecase)))
#+end_src

** Abbreviations
Abbrev mode is a built-in program that helps you speed up your writing by defining abbreviations and common spelling mistakes and automatically replacing them with words, sentences, or complete paragraphs.

#+begin_src elisp :exports none
  ;; Abbreviations
#+end_src
#+begin_src elisp
  (add-hook 'text-mode-hook 'abbrev-mode)
#+end_src

The Lorem Ipsum generator can be helpful when designing a document's layout. This package inserts dummy Latin text into a buffer. 

#+begin_src elisp :exports none
  ;; Lorem Ipsum generator
#+end_src
#+begin_src elisp
  (use-package lorem-ipsum
    :custom
    (lorem-ipsum-list-bullet "- ") ;; Org mode bullets
    :init
    (setq lorem-ipsum-sentence-separator
          (if sentence-end-double-space "  " " "))
    :bind
    (("C-c w s i" . lorem-ipsum-insert-paragraphs)))
#+end_src

** Version control
The built-in Ediff package compares different files and shows their differences. It also lets you decide how to merge the two versions, like a tracked-changes function in a Word processor. The ~ediff~ family of functions does not split its windows nicely by default, so these settings make the program more straightforward to use.

Advanced version control requires a Version Control System, such as Git.

#+begin_src elisp :exports none
  ;; ediff
#+end_src
#+begin_src elisp
  (use-package ediff
    :ensure nil
    :custom
    (ediff-keep-variants nil)
    (ediff-split-window-function 'split-window-horizontally)
    (ediff-window-setup-function 'ediff-setup-windows-plain))
#+end_src

** Other text in modes
Org is fantastic, but it is not the only text mode useful for authors. EWS installs both Markdown and Fountain. Refer to section [[#sec-text-modes]] for details.

#+begin_src elisp :exports none
  ;; Enable Other text modes
  
  ;; Fontain mode for writing scrits
#+end_src
#+begin_src elisp
  (use-package fountain-mode)
#+end_src
#+begin_src elisp :exports none
  ;; Markdown mode
#+end_src
#+begin_src elisp
  (use-package markdown-mode)
#+end_src

* Publication
** Basic settings
This snippet sets some basic export settings for org mode. You can either set  these as variable to apply them to all files by default, or insert them as keywords in your front matter. 

Read the Export Settings section in to Org manual for a detailed description of the possible configurations.

The timestamp for exporting files is set to the European date format of day, month, and year. If you publish for American audiences, perhaps you like to modify the ~org-export-date-timestamp-format~ to ="%B %e %Y"=. These letters stand for the full name of the month, the day number without leading zero, and the year in four digits. See the documentation of the ~format-time-string~ function for details on how to format dates in other methods.

#+begin_src elisp :exports none
  ;; PUBLICATION

  ;; Generic Org Export Settings
#+end_src
#+begin_src elisp
  (use-package org
    :custom
    (org-export-with-drawers nil)
    (org-export-with-todo-keywords nil)
    (org-export-with-toc nil)
    (org-export-with-smart-quotes t)
    (org-export-date-timestamp-format "%e %B %Y"))
#+end_src

