documents/book/99-appendix.org
** Epub
The ox-ePub package exports Org files to the most common e-book format. The ~ox-org~  export is required to enable exporting to Org to prevent issues with the table of contents (section [[#sec-ox-epub]]). 

#+begin_src elisp :exports none
  ;; epub export
#+end_src
#+begin_src elisp
  (use-package ox-epub
    :demand t
    :init
    (require 'ox-org))
#+end_src

** Latex
This configuration part defines the export process from Org to TeX to PDF. This setup also removes any temporary files created in the process. You will obviously need a working version of LaTeX with all relevant packages  installed on your computer.

#+begin_src elisp :exports none
  ;; LaTeX PDF Export settings
#+end_src
#+begin_src elisp
  (use-package ox-latex
    :ensure nil
    :demand t
    :custom
    ;; Multiple LaTeX passes for bibliographies
    (org-latex-pdf-process
     '("pdflatex -interaction nonstopmode -output-directory %o %f"
       "bibtex %b"
       "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
       "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
    ;; Clean temporary files after export
    (org-latex-logfiles-extensions
     (quote ("lof" "lot" "tex~" "aux" "idx" "log" "out"
             "toc" "nav" "snm" "vrb" "dvi" "fdb_latexmk"
             "blg" "brf" "fls" "entoc" "ps" "spl" "bbl"
             "tex" "bcf"))))
#+end_src

The next part defines the EWS document class, which is used to produce the paperback version of this book.

The first part of the code defines the name used in the Org file, in this case =#+latex_class: ews=. The next par is the preamble in LaTeX code. Note that backslashes need to be escaped by using two of them. Org also adds standard packages, read the documentation for ~org-latex-classes~ for details on how to modify the standard inclusions.

The last section defines how the heading levels in the Org file are translated to LaTeX commands. This code defines the first three Org heading levels.

#+begin_src elisp :exports none
  ;; EWS paperback configuration
#+end_src
#+begin_src elisp
  (with-eval-after-load 'ox-latex
    (add-to-list
     'org-latex-classes
     '("ews"
       "\\documentclass[11pt, twoside, hidelinks]{memoir}
        \\setstocksize{9.25in}{7.5in}
        \\settrimmedsize{\\stockheight}{\\stockwidth}{*}
        \\setlrmarginsandblock{2cm}{1cm}{*} 
        \\setulmarginsandblock{1.5cm}{2.25cm}{*}
        \\checkandfixthelayout
        \\setcounter{tocdepth}{0}
        \\OnehalfSpacing
        \\usepackage{ebgaramond}
        \\usepackage[htt]{hyphenat}
        \\chapterstyle{bianchi}
        \\setsecheadstyle{\\normalfont \\raggedright \\textbf}
        \\setsubsecheadstyle{\\normalfont \\raggedright \\textbf}
        \\setsubsubsecheadstyle{\\normalfont\\centering}
        \\renewcommand\\texttt[1]{{\\normalfont\\fontfamily{cmvtt}
          \\selectfont #1}}
        \\usepackage[font={small, it}]{caption}
        \\pagestyle{myheadings}
        \\usepackage{ccicons}
        \\usepackage[authoryear]{natbib}
        \\bibliographystyle{apalike}
        \\usepackage{svg}"
       ("\\chapter{%s}" . "\\chapter*{%s}")
       ("\\section{%s}" . "\\section*{%s}")
       ("\\subsection{%s}" . "\\subsection*{%s}")
       ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))
#+end_src

* Administration
** Getting Things Done
The Org configuration for managing actions and projects sets a custom agenda item that shows the agenda for the next three days, a list of to-do items marked =NEXT=, and a list of items marked =WAIT=.

The ~org-agenda-custom-commands~ variable provides a highly flexible system for crafting agenda views. You could, for example, build an agenda for your private actions and one for your work (section [[#sec-reflect]]).

#+begin_src elisp :exports none
  ;;; ADMINISTRATION

  ;; Bind org agenda command and custom agenda
#+end_src
#+begin_src elisp
  (use-package org
    :custom
    (org-agenda-custom-commands
     '(("e" "Agenda, next actions and waiting"
        ((agenda "" ((org-agenda-overriding-header "Next three days:")
                     (org-agenda-span 3)
                     (org-agenda-start-on-weekday nil)))
         (todo "NEXT" ((org-agenda-overriding-header "Next Actions:")))
         (todo "WAIT" ((org-agenda-overriding-header "Waiting:")))))))
    :bind
    (("C-c a" . org-agenda)))
#+end_src

** Manage files
The Dired package is a convenient and powerful tool for organising your drives and accessing your information. Dired lists files and directories in alphabetical order. I prefer a different view, which shows directories on top and files below them. The ~dired-listing-switches~ variable determines how files are displayed in a Dired buffer.

The ~dired-dwim-target~ variable instructs to guess a default target directory. This means that if a Dired buffer is displayed in some window, use that directory instead of this Dired buffer's current directory.

The ~delete-by-moving-to-trash~ variable moves deleted files to the wastebasket instead of vanishing them into thin air.

The last line enables opening new directories in the same buffer as the current one (using the =a= key), preventing littering your session with Dired buffers. The first time you use this, Emacs asks you to confirm whether you would like to use this option.

#+begin_src elisp :exports none
  ;; FILE MANAGEMENT
#+end_src
#+begin_src elisp
  (use-package dired
    :ensure
    nil
    :commands
    (dired dired-jump)
    :custom
    (dired-listing-switches
     "-goah --group-directories-first --time-style=long-iso")
    (dired-dwim-target t)
    (delete-by-moving-to-trash t)
    :init
    (put 'dired-find-alternate-file 'disabled nil))
#+end_src

The default setting for Dired is to show hidden files, even though they are hidden for a reason. This configuration uses ~dired-omit-mode~ to remove these hidden files from view. You can toggle this behaviour with the full stop key.

#+begin_src elisp :exports none
  ;; Hide or display hidden files
#+end_src
#+begin_src elisp
  (use-package dired
    :ensure nil
    :hook (dired-mode . dired-omit-mode)
    :bind (:map dired-mode-map
                ( "."     . dired-omit-mode))
    :custom (dired-omit-files "^\\.[a-zA-Z0-9]+"))
#+end_src

The ~dired-narrow~ package provides some convenience functions to filter a Dired buffer by a search criterion or a regular expression. 

#+begin_src R
  (use-package dired-narrow)
#+end_src

This next bit of configuration defines how Emacs manages automated backups. The default setting is that the system stores these files in the folder where the original files live, cluttering folders with copies of your stuff.

The setting below modifies the =backup-directory-alist= variable so that Emacs saves all backups (indicated by ="."=) in the =bak= subdirectory of your init folder. Alternatively, you could instruct Emacs not to save backups with ~(setq-default make-backup-files nil)~. I prefer keeping backups as they have saved my bacon a few times.

This configuration also eliminates lock files, which are only useful when working in shared folders. Lock files prevent other users from opening a file when another user is already editing it, but create a lot of clutter when writing by yourself. Change this variable to =t= if you collaborate with others or maintain fles on multiple systems through a file-sharing service such as Nextcloud.

#+begin_src elisp :exports none
  ;; Backup files
#+end_src
#+begin_src elisp
  (setq-default backup-directory-alist
                `(("." . ,(expand-file-name "backups/" user-emacs-directory)))
                version-control t
                delete-old-versions t
                create-lockfiles nil)
#+end_src

Emacs saves a list of recent files using the =recentf= package. This package maintains a list of recently opened files and makes it easy to visit them. The recent files list is automatically saved across Emacs sessions. By default, the recent files mode stores the last twenty opened files, which you can change by adjusting the ~recentf-max-saved-items~ variable, which in EWS is fifty.

#+begin_src elisp :exports none
  ;; Recent files
#+end_src
#+begin_src elisp
  (use-package recentf
    :config
    (recentf-mode t)
    :custom
    (recentf-max-saved-items 50)
    :bind
    (("C-c w r" . recentf-open)))
#+end_src

This last file package enables you to set bookmarks for your favourite locations. The ~bookmark-save-flag~ is set to one, so the bookmarks file is saved every time you add a new one. The default value only saves it when you exit Emacs, which means you could lose bookmarks in the unlikely event of an Emacs or system crash.

#+begin_src elisp :exports none
  ;; Bookmarks
#+end_src
#+begin_src elisp
  (use-package bookmark
    :custom
    (bookmark-save-flag 1)
    :bind
    ("C-x r d" . bookmark-delete))
#+end_src

** Viewing images
Emacs has two modes for viewing and managing images. The image viewer shows individual images, but you can also browse through a directory with the left and right arrow keys.

To enable image manipulation, you will need to install ImageMagic.

Using =C-<ret>= opens an image in the Dired buffer in your favourite editor. The ~image-dired-external-viewer~ variable defines the program you use to edit pictures, in my case GIMP, the GNU Image Manipulation Program.

#+begin_src elisp
  ;; Image viewer
#+end_src
#+begin_src elisp
  (use-package emacs
    :custom
    (image-dired-external-viewer "gimp")
    :bind
    ((:map image-mode-map
           ("k" . image-kill-buffer)
           ("<right>" . image-next-file)
           ("<left>"  . image-previous-file))
     (:map dired-mode-map
           ("C-<return>" . image-dired-dired-display-external))))
#+end_src

The built-in Image-Dired package can generate thumbnails from within a Dired buffer and let you work on images from there. 

#+begin_src elisp
  (use-package image-dired
    :bind
    (("C-c w I" . image-dired))
    (:map image-dired-thumbnail-mode-map
          ("C-<right>" . image-dired-display-next)
          ("C-<left>"  . image-dired-display-previous)))
#+end_src

* Advanced export settings for EWS                                  :noexport:
#+begin_src elisp
  ;; ADVANCED UNDOCUMENTED EXPORT SETTINGS FOR EWS

  ;; Use GraphViz for flow diagrams
  ;; requires GraphViz software
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((dot . t))) ; this line activates GraophViz dot
#+end_src

